#+TITLE: ELISP Solutions to excercises in /Structure and Interpretation of Computer Programs/ (SICP) by Abelson, Sussman and Sussman.
#+OPTIONS: toc:nil
#+STARTUP: latexpreview
#+OPTIONS: toc:nil todo:nil
#+PROPERTY: header-args :results none
#+LATEX_HEADER: \usepackage{qtree}

*** Answer
:PROPERTIES:
:ORDERED:  t
:END:
#+begin_src elisp
;; Recursive
(defun r (n)
    (if (< n 3)
        n
        (+ (r (- n 1)) 
           (* 2(r (- n 2))) 
           (* 3 (r (- n 3))))))
(r 30)
#+end_src

#+RESULTS:
: 61354575194
The recursive function starts taking a long time to run for numbers larger than 28.
#+begin_src elisp
;; Iterative
(defun i (n)
    (defun f (p q r) (+ r (* 2 q) (* 3 p)))
    (setq a 0 
          b 1 
          c 2)
    (while (> n 2)
        (setq d (f a b c)
              a b
              b c
              c d
              n (1- n)))
    d)
(i 70)
#+end_src

#+RESULTS:
: 1057767771186904648
